trade/src/InformationRegisters/НастройкиЗагрузкиНаложенныхПлатежейСервисДоставки/НастройкиЗагрузкиНаложенныхПлатежейСервисДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиЗагрузкиНаложенныхПлатежейСервисДоставки</name>
  <resources>
    <name>ДоговорЭквайринга</name>
    <type>
      <types>CatalogRef.ДоговорыЭквайринга</types>
    </type>
  </resources>
  <dimensions>
    <name>Перевозчик</name>
    <type>
      <types>DefinedType.КонтрагентСервисДоставки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>DefinedType.ОрганизацияСервисДоставки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

trade/src/Documents/ОперацияПоПлатежнойКарте/ОперацияПоПлатежнойКарте.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОперацияПоПлатежнойКарте</name>
  <basedOn>Document.ЗаказКлиента</basedOn>
  <basedOn>Document.СчетНаОплатуКлиенту</basedOn>
  <basedOn>Document.ЗаявкаНаРасходованиеДенежныхСредств</basedOn>
  <basedOn>Document.РеализацияТоваровУслуг</basedOn>
  <basedOn>Document.АктВыполненныхРабот</basedOn>
  <basedOn>Document.ВозвратТоваровОтКлиента</basedOn>
  <basedOn>Document.ОперацияПоПлатежнойКарте</basedOn>
  <basedOn>Document.РеализацияУслугПрочихАктивов</basedOn>
  <registerRecords>InformationRegister.АктивацияПодарочныхСертификатов</registerRecords>
  <registerRecords>InformationRegister.ИсправленияДокументов</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСКлиентами</registerRecords>
  <registerRecords>AccumulationRegister.ПрочиеРасходы</registerRecords>
  <registerRecords>InformationRegister.СуммыДокументовВВалютахУчета</registerRecords>
  <registerRecords>AccumulationRegister.ПартииПрочихРасходов</registerRecords>
  <registerRecords>AccumulationRegister.ПрочиеАктивыПассивы</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияДенежныеСредстваКонтрагент</registerRecords>
  <registerRecords>AccumulationRegister.ПартииРасходовНаСебестоимостьТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ДенежныеСредстваВПути</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСПоставщиками</registerRecords>
  <registerRecords>AccumulationRegister.ДенежныеСредстваКВыплате</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСКлиентамиПоДокументам</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСПоставщикамиПоДокументам</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияДенежныеСредстваДоходыРасходы</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыПоЭквайрингу</registerRecords>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорЭквайринга</name>
    <type>
      <types>CatalogRef.ДоговорыЭквайринга</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭквайринговыйТерминал</name>
    <type>
      <types>CatalogRef.ЭквайринговыеТерминалы</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПлатежнойКарты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>22</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаявкаНаРасходованиеДенежныхСредств</name>
    <type>
      <types>DocumentRef.ЗаявкаНаРасходованиеДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>ОплатаВыполнена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодАвторизации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НеКонтролироватьЗаполнениеЗаявки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДвиженияДенежныхСредств</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаФинансовогоУчета</name>
    <type>
      <types>CatalogRef.ГруппыФинансовогоУчетаРасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДеньгиВнесеныCотрудником</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СотрудникВнесшийДеньги</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектРасчетов</name>
    <type>
      <types>CatalogRef.ОбъектыРасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтражатьКомиссию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаКомиссии</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяРасходов</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаРасходов</name>
    <type>
      <types>Characteristic.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешеныПлатежиБезУказанияЗаявок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Исправление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СторнируемыйДокумент</name>
    <type>
      <types>DocumentRef.ОперацияПоПлатежнойКарте</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсправляемыйДокумент</name>
    <type>
      <types>DocumentRef.ОперацияПоПлатежнойКарте</types>
    </type>
  </attributes>
  <attributes>
    <name>НалогообложениеНДС</name>
    <type>
      <types>EnumRef.ТипыНалогообложенияНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЧекаККМ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторОплатыСБП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ВозвратТоваровОтКлиента</types>
      <types>DocumentRef.ОперацияПоПлатежнойКарте</types>
      <types>DocumentRef.РеализацияУслугПрочихАктивов</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.АктВыполненныхРабот</types>
      <types>DocumentRef.ЗаявкаНаРасходованиеДенежныхСредств</types>
      <types>DocumentRef.СчетНаОплатуКлиенту</types>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>БанкСБП</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектРасчетовКомиссии</name>
    <type>
      <types>CatalogRef.ОбъектыРасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВестиУчетКомиссииВоВзаиморасчетах</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РасшифровкаПлатежа</name>
    <attributes>
      <name>Партнер</name>
      <type>
        <types>CatalogRef.Партнеры</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяДвиженияДенежныхСредств</name>
      <type>
        <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
      </type>
    </attributes>
    <attributes>
      <name>ОснованиеПлатежа</name>
      <type>
        <types>DocumentRef.ВозвратТоваровОтКлиента</types>
        <types>DocumentRef.ПриобретениеТоваровУслуг</types>
        <types>DocumentRef.ОтчетКомиссионера</types>
        <types>DocumentRef.ПервичныйДокумент</types>
        <types>DocumentRef.ЗаказПоставщику</types>
        <types>DocumentRef.ВозвратТоваровПоставщику</types>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
        <types>DocumentRef.ОтчетПоКомиссииМеждуОрганизациями</types>
        <types>DocumentRef.ЗаявкаНаВозвратТоваровОтКлиента</types>
        <types>DocumentRef.ОтчетКомитенту</types>
        <types>DocumentRef.РеализацияУслугПрочихАктивов</types>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
        <types>DocumentRef.ОтчетПоКомиссииМеждуОрганизациямиОСписании</types>
        <types>DocumentRef.СчетФактураВыданный</types>
        <types>DocumentRef.ВыкупВозвратнойТарыКлиентом</types>
        <types>DocumentRef.ПриобретениеУслугПрочихАктивов</types>
        <types>DocumentRef.АктВыполненныхРабот</types>
        <types>DocumentRef.ОтчетКомиссионераОСписании</types>
        <types>DocumentRef.ПередачаТоваровМеждуОрганизациями</types>
        <types>DocumentRef.ВыкупВозвратнойТарыУПоставщика</types>
        <types>DocumentRef.СчетНаОплатуКлиенту</types>
        <types>DocumentRef.ЗаказКлиента</types>
        <types>DocumentRef.ВыкупТоваровХранителем</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВзаиморасчетов</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ВалютаВзаиморасчетов</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектРасчетов</name>
      <type>
        <types>CatalogRef.ОбъектыРасчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КурсЧислительВзаиморасчетов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КурсЗнаменательВзаиморасчетов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПогашения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade/src/CommonModules/СервисДоставкиКлиентПереопределяемый/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Подсистема "Сервис доставки".
// ОбщийМодуль.СервисДоставкиКлиентПереопределяемый.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Обработчик события АвтоПодбор поля формы контактной информации для подбора вариантов адреса по введенной строке.
//
// Параметры:
//     Элемент                  - ПолеФормы      - элемент формы, содержащий представление контактной информации.
//     Текст                    - Строка         - строка текста, введенная пользователем в поле контактной информации.
//     ДанныеВыбора             - СписокЗначений Из Строка - содержит список значений, который будет использован при стандартной
//                                                 обработке события.
//     ПараметрыПолученияДанных - Структура
//                              - Неопределено - содержит параметры поиска, которые будут переданы
//                                в метод ПолучитьДанныеВыбора. Подробнее см. описание расширения поля формы для
//                                поля ввода АвтоПодбор в синтакс-помощнике.
//     Ожидание -   Число       - интервал в секундах после ввода текста, через который произошло событие.
//                                Если 0, то это означает, что событие было вызвано не по поводу ввода текста,
//                                а для формирования списка быстрого выбора. 
//     СтандартнаяОбработка     - Булево         - в данный параметр передается признак выполнения стандартной
//                                системной) обработки события. Если в теле процедуры-обработчика
//                                установить данному параметру значение Ложь, стандартная обработка события
//                                производиться не будет.
//
Процедура АвтоПодборАдреса(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка) Экспорт
	
	УправлениеКонтактнойИнформациейКлиент.АвтоПодборАдреса(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка);
	
КонецПроцедуры

// Устанавливает имя формы выбора объекта, если она отличается от формы выбора по умолчанию.
//
// Параметры:
//  ИмяОбъекта - Строка - имя объекта метаданных.
//  ИмяФормыВыбора - Строка - полное имя формы выбора объекта. Например, "Документ.ЗаказПокупателя.ФормаВыбора".
//
Процедура УстановитьИмяФормыВыбораОбъектаПоИмени(ИмяОбъекта, ИмяФормыВыбора) Экспорт
	
КонецПроцедуры

// Открытие формы нового заказа на доставку, создаваемого на основании переданного объекта
// в параметре "МассивСсылок". Вызывается из подсистемы "ПодключаемыеКоманды".
//
// Параметры:
//  ДокументыОснования - Массив из ЛюбаяСсылка - объект или список объектов.
//  ПараметрыВыполнения - см. ПодключаемыеКомандыКлиентСервер.ПараметрыВыполненияКоманды
//
Процедура ЗаказНаДоставкуСоздатьНаОсновании(ДокументыОснования, ПараметрыВыполнения) Экспорт
	
	ПараметрыВыполненияКоманды = Новый Структура;
	ПараметрыВыполненияКоманды.Вставить("Источник");
	ПараметрыВыполненияКоманды.Вставить("Уникальность");
	ПараметрыВыполненияКоманды.Вставить("Окно");
	ПараметрыВыполненияКоманды.Вставить("НавигационнаяСсылка");
	ОписаниеКоманды = ПараметрыВыполнения.ОписаниеКоманды; // Структура
	ЗаполнитьЗначенияСвойств(ПараметрыВыполненияКоманды, ОписаниеКоманды.ДополнительныеПараметры); 
	
	ПараметрыОткрытия = СервисДоставкиКлиент.НовыйПараметрыОткрытьФормуСервисаДоставки();
	ПараметрыОткрытия.Вставить("ПараметрыВыполненияКоманды", ПараметрыВыполненияКоманды);
	
	Если ТипЗнч(ДокументыОснования) = Тип("Массив") Тогда
		ПараметрыОткрытия.ДокументыОснования.ЗагрузитьЗначения(ДокументыОснования);
	Иначе
		ПараметрыОткрытия.ДокументыОснования.Добавить(ДокументыОснования);
	КонецЕсли;
	
	ТипГрузоперевозки = 0;
	
	Если ОписаниеКоманды.Идентификатор = "СоздатьНовыйЗаказНаДоставку" Тогда
		ТипГрузоперевозки = 1;
	ИначеЕсли ОписаниеКоманды.Идентификатор = "СоздатьНовыйЗаказНаКурьерскуюДоставку" Тогда
		ТипГрузоперевозки = 2;
	ИначеЕсли ОписаниеКоманды.Идентификатор = "СоздатьНовыйЗаказНаДоставкуКурьерика" Тогда
		ТипГрузоперевозки = 3;
	ИначеЕсли ОписаниеКоманды.Идентификатор = "СоздатьНовыйЗаказНаДоставкуСДЭК" Тогда
		ТипГрузоперевозки = 4;
	КонецЕсли;
	
	Если ТипГрузоперевозки <> 0 Тогда
		ПараметрыОткрытия.Вставить("ТипГрузоперевозки", ТипГрузоперевозки);
	КонецЕсли;
	
	Если Не (ТипГрузоперевозки = 3 И ПараметрыОткрытия.ДокументыОснования.Количество() > 1) Тогда
		ПроверитьСуществованиеЗаказовНаДоставкуПоОснованию(ПараметрыОткрытия);
		Возврат;
	КонецЕсли;
	
	СервисДоставкиКлиент.ОткрытьФормуСервисаДоставки(ПараметрыОткрытия);
	
КонецПроцедуры

// Открытие формы нового заказа на доставку, создаваемого на основании документа.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма документа.
//
Процедура ОткрытьФормуНовогоЗаказаНаДоставку(Форма) Экспорт
	
	// Запись в форме объекта.
	Если Не Форма.Объект.Проведен Или Форма.Модифицированность Тогда
			
		ТекстВопроса = НСтр("ru = 'Для создания заказа на доставку
			|документ будет проведен. Продолжить?'");
		
		Кнопки = Новый СписокЗначений;
		Кнопки.Добавить(КодВозвратаДиалога.ОК, НСтр("ru = 'Провести и продолжить'"));
		Кнопки.Добавить(КодВозвратаДиалога.Отмена);
		
		Обработчик = Новый ОписаниеОповещения("ПродолжитьВыполнениеКомандыОткрытьФормуНовогоЗаказаНаДоставку", ЭтотОбъект, Форма);
		
		ПоказатьВопрос(Обработчик, ТекстВопроса, Кнопки);
		Возврат;
		
	КонецЕсли;
	
	ПроверитьСуществованиеЗаказовНаДоставкуПоОснованию(Форма);
	
КонецПроцедуры

// Обработка выбора заказа на доставку из списка выбора заказов.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма документа.
//  ВыбранныйЗаказ - ДанныеФормыЭлементКоллекции, Неопределено - Строка списка заказов.
//  ИмяПроцедурыОбработки - Строка - Имя процедуры обработки выбора заказа в списке заказов.
//
Процедура ОбработатьРезультатВыбораЗаказаНаДоставку(Форма, ВыбранныйЗаказ, ИмяПроцедурыОбработки) Экспорт
	
КонецПроцедуры

// Открытие списка платежных документов
// 
// Параметры:
//  ПараметрыСписка - Структура - Параметры списка. Содержит свойства:
//  *Организация - ОпределяемыйТип.ОрганизацияСервисДоставки - организация-заказчик перевозки,
//  *ДоговорыЭквайринга - массив из СправочникСсылка.ДоговорыЭквайринга - договора эквайринга, указанные в настройках
//    сервиса доставки.
//
Процедура ПерейтиКСпискуПлатежныхДокументов(ПараметрыСписка) Экспорт
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Организация", ПараметрыСписка.Организация);
	ПараметрыОтбора.Вставить("ДоговорЭквайринга", ПараметрыСписка.ДоговорыЭквайринга);
		
	ПараметрыФормы = Новый Структура("Отбор", ПараметрыОтбора);
	
	ОткрытьФорму("Документ.ОперацияПоПлатежнойКарте.ФормаСписка", ПараметрыФормы);
	
КонецПроцедуры

// Открывает форму настроек, если требуется
//
Процедура ОткрытьФормуНастройкиСозданиеПлатежныхДокументов() Экспорт
	
	ОткрытьФорму("РегистрСведений.НастройкиЗагрузкиНаложенныхПлатежейСервисДоставки.ФормаСписка");
	
КонецПроцедуры

#Область НаложенныеПлатежи

// Заполняет перечень типов документов-оснований, для которых можно оформить оплату доставки наложенным платежом.
//  
// Параметры:
//	КоллекцияТиповДокументов - Массив из ОписаниеТипов
Процедура ТипыОснованийДляНаложенногоПлатежа(КоллекцияТиповДокументов) Экспорт
	
	КоллекцияТиповДокументов.Добавить(Тип("ДокументСсылка.ЗаказКлиента"));
	КоллекцияТиповДокументов.Добавить(Тип("ДокументСсылка.РеализацияТоваровУслуг"));
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Параметры:
//	Ответ - КодВозвратаДиалога
//	Форма - ФормаКлиентскогоПриложения - форма
Процедура ПродолжитьВыполнениеКомандыОткрытьФормуНовогоЗаказаНаДоставку(Ответ, Форма) Экспорт
	
	Если Ответ = КодВозвратаДиалога.ОК Тогда
		
		ОчиститьСообщения();
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("Форма", Форма);
		ДействиеПослеЗаписи = Новый ОписаниеОповещения("ПослеПроведенияДокумента", ЭтотОбъект, ДополнительныеПараметры);
		
		ПараметрыЗаписи = Новый Структура;
		ПараметрыЗаписи.Вставить("РежимЗаписи", РежимЗаписиДокумента.Проведение);
		ПараметрыЗаписи.Вставить("ДействиеПослеЗаписи", ДействиеПослеЗаписи);
		
		Форма.Записать(ПараметрыЗаписи);
		
	КонецЕсли;
	
КонецПроцедуры

// После проведения документа.
// 
// Параметры:
//  Результат - Булево - Результат проведения документа
//  ДополнительныеПараметры - Структура:
//   * Форма - ФормаКлиентскогоПриложения - 
Процедура ПослеПроведенияДокумента(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Истина Тогда
		Форма = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, "Форма");
		Если Форма <> Неопределено Тогда
			ПроверитьСуществованиеЗаказовНаДоставкуПоОснованию(Форма);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//	Контекст - ФормаКлиентскогоПриложения - форма:
//		* Объект - Структура - коллекция реквизитов заказа на доставку:
//		** Ссылка - ДокументСсылка, Неопределено - ссылка на документ,
//			 - Структура - Контекст открытия формы.
Процедура ЗавершитьВыполнениеКомандыОткрытьФормуНовогоЗаказаНаДоставку(Контекст)
	
	Если ТипЗнч(Контекст) = Тип("ФормаКлиентскогоПриложения") Тогда
		
		ПараметрыОткрытия = СервисДоставкиКлиент.НовыйПараметрыОткрытьФормуСервисаДоставки();
		
		ПараметрыОткрытия.ОрганизацияБизнесСети = Контекст.Объект["Организация"];
		Если ЗначениеЗаполнено(Контекст.Объект["Ссылка"]) Тогда
			ПараметрыОткрытия.ДокументыОснования.Добавить(Контекст.Объект["Ссылка"]);
		КонецЕсли;
		
		ДанныеВладельцаФормы = Новый Структура;
		ДанныеВладельцаФормы.Вставить("Форма", Контекст);
		ДанныеВладельцаФормы.Вставить("Элемент", Контекст.ТекущийЭлемент);
		
	Иначе
		
		ПараметрыОткрытия = Контекст;
		ДанныеВладельцаФормы = Неопределено;
		
	КонецЕсли;
	
	СервисДоставкиКлиент.ОткрытьФормуСервисаДоставки(ПараметрыОткрытия, ДанныеВладельцаФормы);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Проверить существование заказов на доставку по переданным параметрам.
// 
// Параметры:
//	Контекст - ФормаКлиентскогоПриложения - форма:
//		* Объект - Структура - коллекция реквизитов заказа на доставку:
//		** Ссылка - ДокументСсылка, Неопределено - ссылка на документ,
//			 - Структура - Контекст открытия формы.
Процедура ПроверитьСуществованиеЗаказовНаДоставкуПоОснованию(Контекст)
	
	Если ТипЗнч(Контекст) = Тип("Структура") Тогда
		Если ТипЗнч(Контекст.ДокументыОснования[0]) = Тип("ЭлементСпискаЗначений") Тогда
			ДокументОснование = Контекст.ДокументыОснования[0].Значение;
		Иначе
			ДокументОснование = Контекст.ДокументыОснования[0];
		КонецЕсли;
	Иначе
		ДокументОснование = Контекст.Объект.Ссылка;
	КонецЕсли;
	
	Результат = СервисДоставкиВызовСервера.КоличествоЗаказовПоОснованиям(ДокументОснование);
	
	Если Результат.Количество() > 0 И Результат[0].Значение > 0 Тогда
		
		ТекстВопроса = Стршаблон(НСтр("ru = 'На основании %1 введено заказов на доставку: %2.
			|Продолжить?'"), Результат[0].Представление, Результат[0].Значение);
		
		Кнопки = Новый СписокЗначений;
		Кнопки.Добавить(КодВозвратаДиалога.ОК, НСтр("ru = 'Продолжить'"));
		Кнопки.Добавить(КодВозвратаДиалога.Отмена);
		
		Обработчик = Новый ОписаниеОповещения("ПродолжитьПроверитьСуществованиеЗаказовНаДоставкуПоОснованию", ЭтотОбъект, Контекст);
		
		ПоказатьВопрос(Обработчик, ТекстВопроса, Кнопки);
		Возврат;
		
	КонецЕсли;
	
	ЗавершитьВыполнениеКомандыОткрытьФормуНовогоЗаказаНаДоставку(Контекст);
	
КонецПроцедуры

// Параметры:
//	Ответ - КодВозвратаДиалога
//	Контекст - ФормаКлиентскогоПриложения - форма:
//		* Объект - Структура - коллекция реквизитов заказа на доставку:
//		** Ссылка - ДокументСсылка, Неопределено - ссылка на документ,
//			 - Структура - Контекст открытия формы.
Процедура ПродолжитьПроверитьСуществованиеЗаказовНаДоставкуПоОснованию(Ответ, Контекст) Экспорт
	
	Если Ответ = КодВозвратаДиалога.ОК Тогда
		ОчиститьСообщения();
		ЗавершитьВыполнениеКомандыОткрытьФормуНовогоЗаказаНаДоставку(Контекст);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
